参照集合 = {1, 2, 3, 4, 5, 6}
集合2 = {5, 6, 7, 8, 9, 0}
子集 = {1, 2, 3}
超集 = {1, 2, 3, 4, 5, 6, 7, 8, 9, 0}

#合集
print("合集:",参照集合.union(集合2))

#交集
print("交集:",参照集合.intersection(集合2))

#获取 去除重复元素后重组的集合
print("去重重组:", 参照集合.symmetric_difference(集合2))

#子集判断
print("is子集:", 子集.issubset(参照集合))#主宾位置类似于自然语言

#超集判断
print("is超集", 超集.issuperset(参照集合))#同上

#差集:返回集合,该集合的元素仅集合2,参照集合没有,如果主对象是宾对象的子集,返回set(),(宾对象:自创名词)
print("差集", 集合2.difference(参照集合))
print("差集:返回set()", 子集.difference(参照集合))

#多个参数示例
print("多参数交集", 参照集合.intersection(集合2, 超集))

