
def 不使用推导式():
    输入的字符串 = ["1", "5", "28", "131", "3"]
    输出的整数 = []
    for num in 输入的字符串:
        输出的整数.append(int(num))
    print(输出的整数)

def 使用推导式():
    输入的字符串 = ["1", "5", "28", "131", "3"]
    输出的整数 = [int(num) for num in 输入的字符串]
    print(输出的整数)

def 列表推导式组合if():
    输入的字符串 = ["1", "5", "28", "131", "3"]
    输出的整数 = [int(num) for num in 输入的字符串 if len(num) < 3]
    print(输出的整数)
    
print("不使用#------------------------------------------------------------------------")
不使用推导式()
print("使用#------------------------------------------------------------------------")
使用推导式()
print("组合if#------------------------------------------------------------------------")
列表推导式组合if()
